# Решить задачи, которые не успели решить на семинаре, задача №2

# Напишите фукцию, которая в бесконечном цикле запрашивает имя, 
# личный индетификатор и уровень доступа (от 1 до 7)
# После каждого ввода добавляйте новую информацию в JSON файл.
# Пользователи группируются по уровню доступа.
# Идентификатор пользователя выступает ключём для имени.
# Убедитесь, что все идентификаторы уникальны независимо от увроня
# доступа.
# При перезапуске функции уже записанные в файл данные должны
# сохраняться.

