# Решить задачи, которые не успели решить на семинаре, задача №4

# Создайте функцию, которая создаёт файлы с указанным расщирением.
# Функция принимает следующие параметры:
# - расширение;
# - минимальная длина сучайного сгенирированого имени, по уполмочанию 6;
# - максимальная длина случайно сгенерированного имени, по уполмочанию 30;
# - минимальное число случайных байт, 
# записанных в файл, по уполмочанию 256;
# - максимальное число случайных байт, 
# записанных в файл по умолмочанию 4096;
# - количество файлов, по умолчанию 42.
# Имя файла и его размер должны быть в рамках переданного диапазона.

