# 3. Напишите функцию принимающую на вход только ключевые параметры и возвращающую словарь, 
# где ключ — значение переданного аргумента, а значение — имя аргумента. 
# Если ключ не хешируем, используйте его строковое представление.

def convert_to_dict():
    
    return 0


print(convert_to_dict(a = 1, b = 'Pony', c = [1, 2, 3], d = (4, 5), e = 3.14))
