# Решить задачи, которые не успели решить на семинаре.

#-----------
# Задача №1
#-----------

# Вспомните какие модули вы уже проходили на курсе.
# Создайте файл, в котором вы импортируете встроенные в модуль функции
# под псевдонимами (3-7 строк импорта).

from random import randint as rand # - Модуль рандомного случайного псевдо числа
from decimal import Decimal as dec # - Работа с точными числами
from math import sqrt as sq # - Извлечение корня числа
from fractions import Fraction as F # Дроби
from sys import argv as av # - Список параметров командной строки 
