# 1. Решить задачи, которые не успели решить на семинаре.

#-----------
# Задача №1
#-----------

# Пользователь вводит строку из четырёх
# или более целых чисел, разделённых символом "/".
# Сформируйте словарь, где:
# - второе и третье число являются ключами
# - первое число является значением для первого ключа.
# - Четвертое и все возможные последующие числа 
# хранятся в кортеже как значения второго ключа

#-----------
# Задача №2
#-----------

# Самостоятельно сохраните в переменной строку текста.
# Создайте из строки словарь, где ключ-буква,
# а значение - код буквы.
# Напишите преобразование в одну строку.

#-----------
# Задача №3
#-----------

# Продолжаем развивать задачу 2.
# Возьмите словарь, который вы получили,
# сохраните его итератор.
# Далее выведите первые 5 пар ключ-значение,
# обращаясь к итератору, а не к словарю.

#-----------
# Задача №4
#-----------

# Создайте генератор чётных чисел от нуля до 100.
# Из последовательности исключите числа, сумма
# цифр которых равна 8
# Решение в одну строку.

#-----------
# Задача №5
#-----------

# Напишите программу, которая выводит на экран
# числа от 1 до 100.
# При этом вместо чисел, кратных трем,
# программа должна выводить слово "Fizz"
# Вместо чисел, кратных пяти - слово "Buzz"
# Если число кратно и 3 и 5 то программа
# должна выводить слово "FizzBuzz"
# Превратите решение в генераторное выражение.

#-----------
# Задача №6
#-----------

# Выведете в консоль таблицу умножения 
# от 2х2 до 9х10 как в школьной тетрадке.
# Таблицу создайте в виде однострочного 
# генератора, где каждый элемент генератора
# отдельный пример таблицы умножения.
# Для вывода результата испльзуйте "принт"
# без перехода на новую строку.

#-----------
# Задача №7
#-----------

# Создайте функцию-генератор.
# Функция генерирует N простых чисел,
# начиная с числа 2.
# Для проверки числа на простоту используйте
# правило: "число является простым, если
# делиться нацело только на единицу и на себя"
